In [1]:
import pandas as pd
import numpy as np

In [2]:
lst =['A','B','C']
lst = np.array(lst)

In [3]:
lst2 = ['a','b','c']

In [4]:
pd.Series(lst,lst2)

a    A
b    B
c    C
dtype: object

In [5]:
pd.Series(data = lst,index=lst2)

a    A
b    B
c    C
dtype: object

In [6]:
d = {'a':'A','b':'B','c':'C'}

In [7]:
pd.Series(d)

a    A
b    B
c    C
dtype: object

In [8]:
fam = ['raja','rajeshwari','dhivya','dinesh']

In [9]:
s1 = pd.Series(fam,index =[1,2,3,4])

In [10]:
s1

1          raja
2    rajeshwari
3        dhivya
4        dinesh
dtype: object

In [11]:
gf = ['ragul','sound','dinesh','surya']

In [12]:
s2 = pd.Series(gf)

In [13]:
s2

0     ragul
1     sound
2    dinesh
3     surya
dtype: object

In [14]:
gf1 = pd.Series([1,2,3,4],index = ['ragul','sound','dinesh','surya'])

In [15]:
gf1

ragul     1
sound     2
dinesh    3
surya     4
dtype: int64

In [16]:
gf2 = pd.Series([1,2,4,5],index = ['ragul','vicky','dinesh','surya'])

In [17]:
gf2

ragul     1
vicky     2
dinesh    4
surya     5
dtype: int64

In [18]:
gf1+gf2

dinesh    7.0
ragul     2.0
sound     NaN
surya     9.0
vicky     NaN
dtype: float64

In [19]:
from numpy.random import randn

In [20]:
df = pd.DataFrame(randn(5,5),index =('A','B','C', 'D', 'E'),columns = 'P Q R S T'.split())

In [21]:
df

          P         Q         R         S         T
A -1.674909  0.024311  0.429149 -0.298259 -0.491807
B -0.883063 -2.333580 -0.036947  0.362250  0.181601
C  0.170798  0.172723  2.097848  1.659704 -0.892505
D -0.696017 -0.232502 -0.958822 -0.087089  0.351932
E -0.475155 -1.310335  0.422541 -0.409640 -0.362233

In [22]:
type(df['P'])

pandas.core.series.Series

In [23]:
df['P']

A   -1.674909
B   -0.883063
C    0.170798
D   -0.696017
E   -0.475155
Name: P, dtype: float64

In [24]:
df[['P','R']]

          P         R
A -1.674909  0.429149
B -0.883063 -0.036947
C  0.170798  2.097848
D -0.696017 -0.958822
E -0.475155  0.422541

In [25]:
type(df[['P','R']])

pandas.core.frame.DataFrame

In [26]:
df['U'] = df['P'] - df['Q']

In [27]:
df

          P         Q         R         S         T         U
A -1.674909  0.024311  0.429149 -0.298259 -0.491807 -1.699221
B -0.883063 -2.333580 -0.036947  0.362250  0.181601  1.450518
C  0.170798  0.172723  2.097848  1.659704 -0.892505 -0.001925
D -0.696017 -0.232502 -0.958822 -0.087089  0.351932 -0.463515
E -0.475155 -1.310335  0.422541 -0.409640 -0.362233  0.835179

# axis =0 means to access a row
# axis =1 means to access a columns

## inplace : to give inplace confirmly drop (column or row)

In [28]:
df.drop('U',axis = 1,inplace = True)

In [29]:
df

          P         Q         R         S         T
A -1.674909  0.024311  0.429149 -0.298259 -0.491807
B -0.883063 -2.333580 -0.036947  0.362250  0.181601
C  0.170798  0.172723  2.097848  1.659704 -0.892505
D -0.696017 -0.232502 -0.958822 -0.087089  0.351932
E -0.475155 -1.310335  0.422541 -0.409640 -0.362233

In [30]:
df.drop('C',axis = 0)

          P         Q         R         S         T
A -1.674909  0.024311  0.429149 -0.298259 -0.491807
B -0.883063 -2.333580 -0.036947  0.362250  0.181601
D -0.696017 -0.232502 -0.958822 -0.087089  0.351932
E -0.475155 -1.310335  0.422541 -0.409640 -0.362233

In [31]:
df

          P         Q         R         S         T
A -1.674909  0.024311  0.429149 -0.298259 -0.491807
B -0.883063 -2.333580 -0.036947  0.362250  0.181601
C  0.170798  0.172723  2.097848  1.659704 -0.892505
D -0.696017 -0.232502 -0.958822 -0.087089  0.351932
E -0.475155 -1.310335  0.422541 -0.409640 -0.362233

# if u want use row means use loc eg:(df.loc['B'])

# if u want use index means use iloc eg:(df.iloc[1])

In [32]:
df.loc['B']

P   -0.883063
Q   -2.333580
R   -0.036947
S    0.362250
T    0.181601
Name: B, dtype: float64

In [33]:
df.iloc[1]

P   -0.883063
Q   -2.333580
R   -0.036947
S    0.362250
T    0.181601
Name: B, dtype: float64

In [34]:
df.iloc[0:,:2]

          P         Q
A -1.674909  0.024311
B -0.883063 -2.333580
C  0.170798  0.172723
D -0.696017 -0.232502
E -0.475155 -1.310335

In [35]:
df.iloc[0:,:1]

          P
A -1.674909
B -0.883063
C  0.170798
D -0.696017
E -0.475155

In [36]:
df.loc[['A','B'],['P','Q']]

          P         Q
A -1.674909  0.024311
B -0.883063 -2.333580

# to find a less than 0 or greater than 0 value

In [37]:
df > 0

       P      Q      R      S      T
A  False   True   True  False  False
B  False  False  False   True   True
C   True   True   True   True  False
D  False  False  False  False   True
E  False  False   True  False  False

In [38]:
df

          P         Q         R         S         T
A -1.674909  0.024311  0.429149 -0.298259 -0.491807
B -0.883063 -2.333580 -0.036947  0.362250  0.181601
C  0.170798  0.172723  2.097848  1.659704 -0.892505
D -0.696017 -0.232502 -0.958822 -0.087089  0.351932
E -0.475155 -1.310335  0.422541 -0.409640 -0.362233

In [39]:
df[df>0]

          P         Q         R         S         T
A       NaN  0.024311  0.429149       NaN       NaN
B       NaN       NaN       NaN  0.362250  0.181601
C  0.170798  0.172723  2.097848  1.659704       NaN
D       NaN       NaN       NaN       NaN  0.351932
E       NaN       NaN  0.422541       NaN       NaN

In [40]:
df[df<0]

          P         Q         R         S         T
A -1.674909       NaN       NaN -0.298259 -0.491807
B -0.883063 -2.333580 -0.036947       NaN       NaN
C       NaN       NaN       NaN       NaN -0.892505
D -0.696017 -0.232502 -0.958822 -0.087089       NaN
E -0.475155 -1.310335       NaN -0.409640 -0.362233

In [41]:
df[df['P']>0][['P','Q']]

          P         Q
C  0.170798  0.172723

In [42]:
df[(df['P']> 0) & df['R']>0][['P','R']]

          P         R
C  0.170798  2.097848

In [43]:
df

          P         Q         R         S         T
A -1.674909  0.024311  0.429149 -0.298259 -0.491807
B -0.883063 -2.333580 -0.036947  0.362250  0.181601
C  0.170798  0.172723  2.097848  1.659704 -0.892505
D -0.696017 -0.232502 -0.958822 -0.087089  0.351932
E -0.475155 -1.310335  0.422541 -0.409640 -0.362233

# how to reset a index in dataset

In [44]:
df.reset_index()

  index         P         Q         R         S         T
0     A -1.674909  0.024311  0.429149 -0.298259 -0.491807
1     B -0.883063 -2.333580 -0.036947  0.362250  0.181601
2     C  0.170798  0.172723  2.097848  1.659704 -0.892505
3     D -0.696017 -0.232502 -0.958822 -0.087089  0.351932
4     E -0.475155 -1.310335  0.422541 -0.409640 -0.362233

In [45]:
df

          P         Q         R         S         T
A -1.674909  0.024311  0.429149 -0.298259 -0.491807
B -0.883063 -2.333580 -0.036947  0.362250  0.181601
C  0.170798  0.172723  2.097848  1.659704 -0.892505
D -0.696017 -0.232502 -0.958822 -0.087089  0.351932
E -0.475155 -1.310335  0.422541 -0.409640 -0.362233

In [46]:
lst = 'AA BB CC DD EE'.split()

In [47]:
df['Index'] = lst

In [48]:
df

          P         Q         R         S         T Index
A -1.674909  0.024311  0.429149 -0.298259 -0.491807    AA
B -0.883063 -2.333580 -0.036947  0.362250  0.181601    BB
C  0.170798  0.172723  2.097848  1.659704 -0.892505    CC
D -0.696017 -0.232502 -0.958822 -0.087089  0.351932    DD
E -0.475155 -1.310335  0.422541 -0.409640 -0.362233    EE

In [49]:
df.set_index('Index')

              P         Q         R         S         T
Index
AA    -1.674909  0.024311  0.429149 -0.298259 -0.491807
BB    -0.883063 -2.333580 -0.036947  0.362250  0.181601
CC     0.170798  0.172723  2.097848  1.659704 -0.892505
DD    -0.696017 -0.232502 -0.958822 -0.087089  0.351932
EE    -0.475155 -1.310335  0.422541 -0.409640 -0.362233

# Multi index using function

In [50]:
# index levels

outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [51]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [52]:
df = pd.DataFrame(np.random.randn(6,2),index = hier_index,columns = ['A','B'])

In [53]:
df

             A         B
G1 1 -1.159446 -0.545495
   2 -0.360617 -0.936375
   3  1.407747 -0.387312
G2 1 -0.539280 -0.922268
   2  1.134362 -0.016038
   3 -2.055361 -0.057289

In [54]:
df.loc['G1'].loc[1:]

          A         B
1 -1.159446 -0.545495
2 -0.360617 -0.936375
3  1.407747 -0.387312

In [55]:
df.loc['G2'].loc[1:]

          A         B
1 -0.539280 -0.922268
2  1.134362 -0.016038
3 -2.055361 -0.057289

In [56]:
df.index.names

FrozenList([None, None])

In [57]:
df.index.names = ['Group','Num']

In [58]:
df

                  A         B
Group Num
G1    1   -1.159446 -0.545495
      2   -0.360617 -0.936375
      3    1.407747 -0.387312
G2    1   -0.539280 -0.922268
      2    1.134362 -0.016038
      3   -2.055361 -0.057289

In [59]:
df.xs(['G1',2])

C:\Users\dines\AppData\Local\Temp\ipykernel_11956\3186320982.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['G1',2])

A   -0.360617
B   -0.936375
Name: (G1, 2), dtype: float64

In [60]:
df.xs(1,level = 'Num')

              A         B
Group
G1    -1.159446 -0.545495
G2    -0.539280 -0.922268

# To find a Missing values and fillna values

In [61]:
import pandas as pd
import numpy as np

In [62]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [63]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [64]:
df.dropna()

     A    B  C
0  1.0  5.0  1

# access columns axis = 1

In [65]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

# Thresh using allow nan value to given number eg : thresh = 1

In [66]:
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [67]:
df.fillna(value = '***')

     A    B  C
0  1.0  5.0  1
1  2.0  ***  2
2  ***  ***  3

## If u want to change dataset means u compulsory use inplace = True

In [68]:
df['B'].fillna(value = df['C'].mean())

0    5.0
1    2.0
2    2.0
Name: B, dtype: float64

In [69]:
df['C'].mean()

2.0

In [70]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

## Groupby function using to find number avg in one function

In [71]:
data = {'Company':['Google','Google','FB','HCL','ZOHO','ZOHO'],
       'Person':['Dinesh','Surya','Kavin','Gokul','Ragul','Vignesh'],
       'Sales':[200,220,350,360,190,100]}

In [72]:
data

{'Company': ['Google', 'Google', 'FB', 'HCL', 'ZOHO', 'ZOHO'],
 'Person': ['Dinesh', 'Surya', 'Kavin', 'Gokul', 'Ragul', 'Vignesh'],
 'Sales': [200, 220, 350, 360, 190, 100]}

In [73]:
df = pd.DataFrame(data)

In [74]:
df

  Company   Person  Sales
0  Google   Dinesh    200
1  Google    Surya    220
2      FB    Kavin    350
3     HCL    Gokul    360
4    ZOHO    Ragul    190
5    ZOHO  Vignesh    100

In [75]:
df.groupby('Company').mean()

         Sales
Company
FB       350.0
Google   210.0
HCL      360.0
ZOHO     145.0

In [76]:
df.groupby('Company')

In [77]:
d = df.groupby('Company')

In [78]:
d.mean()

         Sales
Company
FB       350.0
Google   210.0
HCL      360.0
ZOHO     145.0

In [79]:
df.groupby('Company').std()

             Sales
Company
FB             NaN
Google   14.142136
HCL            NaN
ZOHO     63.639610

In [80]:
df.groupby('Company').min()

         Person  Sales
Company
FB        Kavin    350
Google   Dinesh    200
HCL       Gokul    360
ZOHO      Ragul    100

In [81]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Kavin    350
Google     Surya    220
HCL        Gokul    360
ZOHO     Vignesh    190

In [82]:
df.groupby('Company').median()

         Sales
Company
FB       350.0
Google   210.0
HCL      360.0
ZOHO     145.0

In [83]:
df.describe()

            Sales
count    6.000000
mean   236.666667
std    100.531919
min    100.000000
25%    192.500000
50%    210.000000
75%    317.500000
max    360.000000

In [84]:
df.groupby('Company').count()

         Person  Sales
Company
FB            1      1
Google        2      2
HCL           1      1
ZOHO          2      2

In [85]:
df.groupby('Company').sum()

         Sales
Company
FB         350
Google     420
HCL        360
ZOHO       290

In [86]:
df.groupby('Company').value_counts()

Company  Person   Sales
FB       Kavin    350      1
Google   Dinesh   200      1
         Surya    220      1
HCL      Gokul    360      1
ZOHO     Ragul    190      1
         Vignesh  100      1
dtype: int64

# Merging, Joining, and Concantenating

In [87]:
import pandas as pd

In [88]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [89]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [90]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [91]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [92]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [93]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## To join a two dataframe means we use[ concat key] for dataframe

In [94]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [95]:
pd.concat([df1,df2,df3],axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

# Merging Example DataFrames

In [96]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [97]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [98]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [99]:
pd.merge(left,right,how = 'inner',on ='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

### Or to show a more complicated example:

In [100]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [101]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [102]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [103]:
pd.merge(left,right,on = ['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [104]:
pd.merge(left,right,how = 'outer',on = ['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [105]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

# Joining

In [106]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [107]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [108]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [109]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [110]:
left.join(right,how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [111]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [112]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [113]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [114]:
df['col2'].nunique()

3

In [115]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [116]:
df[df['col1'] == 2]

   col1  col2 col3
1     2   555  def

In [117]:
def sq(d):
    return d **2

In [118]:
df['col1'].apply(sq)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [119]:
df['col2'].apply(sq)

0    197136
1    308025
2    443556
3    197136
Name: col2, dtype: int64

In [120]:
df['col2'].sum()

2109

In [121]:
del df['col1']

In [122]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [123]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [124]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [125]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [126]:
df.sort_values(by = 'col2',inplace = True)

In [127]:
df

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [128]:
df.isna().sum()

col2    0
col3    0
dtype: int64

In [129]:
df.dropna()

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [130]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

### ** Filling in NaN values with something else: **

In [131]:
df.fillna('@@')

  col1   col2 col3
0  1.0     @@  abc
1  2.0  555.0  def
2  3.0  666.0  ghi
3   @@  444.0  xyz

In [132]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [133]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [134]:
df.pivot_table(values = 'D',index = ['A','B'],columns ='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data input and ouput

# CSV

In [135]:
df = pd.read_csv('example.txt')

In [136]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

# string to replace a np.nan values

In [137]:
df['A'] = df['A'].replace('foo',np.nan)

In [138]:
df

     A    B  C  D
0  NaN  one  x  1
1  NaN  one  y  3
2  NaN  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

# new dataset read

In [139]:
data = pd.read_csv('Salaries.csv')

In [140]:
data.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

# To find a column with id number

In [141]:
data[data['Id'] == 75666]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
75665,75666,Deanna J DeSedas,"Manager V, MTA",145064.69,0.0,5719.62,51082.69,150784.31,201867.0,2013,NaN,San Francisco,NaN

In [142]:
data.shape

(148654, 13)

In [143]:
data.isna().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                609
OvertimePay              4
OtherPay                 4
Benefits             36163
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              148654
dtype: int64

# pd.get_dummies to get dummi values of the column

In [144]:
pd.get_dummies(data['JobTitle'])

,ACCOUNT CLERK,ACCOUNTANT,ACCOUNTANT INTERN,"ACPO,JuvP, Juv Prob (SFERS)",ACUPUNCTURIST,ADMINISTRATIVE ANALYST,ADMINISTRATIVE ANALYST II,ADMINISTRATIVE ANALYST III,ADMINISTRATIVE ENGINEER,ADMINISTRATIVE SERVICES MANAGER,...,Window Cleaner Supervisor,Wire Rope Cable Maint Mechanic,Wire Rope Cable Maint Sprv,Worker's Comp Supervisor 1,Worker's Compensation Adjuster,X-RAY LABORATORY AIDE,X-Ray Laboratory Aide,"YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS",Youth Comm Advisor,ZOO CURATOR
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
148650,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
148651,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
148652,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
148653,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

# Method 1 to print a categorical and numerical columns

In [145]:
# they print categorical columns only
cat_arr = []

In [146]:
for i in data.columns:
    if data[i].dtypes=='object':
        cat_arr.append(i)

In [147]:
cat_arr

['EmployeeName', 'JobTitle', 'Agency']

# Method 2 to print a categorical and numerical columns

In [148]:
categorical_cols = data.select_dtypes(include=['object']).columns.tolist()

In [149]:
categorical_cols

['EmployeeName', 'JobTitle', 'Agency']

In [150]:
num_cols = data.select_dtypes(include=[int,float]).columns.tolist()

In [151]:
num_cols

['Id',
 'BasePay',
 'OvertimePay',
 'OtherPay',
 'Benefits',
 'TotalPay',
 'TotalPayBenefits',
 'Year',
 'Notes',
 'Status']

# Method 3 include & exclude

In [152]:
num_cols = data.select_dtypes(exclude =['object']).columns.tolist()

In [153]:
num_cols

['Id',
 'BasePay',
 'OvertimePay',
 'OtherPay',
 'Benefits',
 'TotalPay',
 'TotalPayBenefits',
 'Year',
 'Notes',
 'Status']

In [154]:
ls

 Volume in drive C is Local Disk
 Volume Serial Number is 90A7-8E7A

 Directory of C:\Users\dines\data science\Pandas

24-Apr-23  07:46 PM    <DIR>          .
18-May-23  12:29 AM    <DIR>          ..
13-Apr-23  08:44 PM    <DIR>          .ipynb_checkpoints
13-Apr-23  11:32 AM    <DIR>          DV - Pandas Bulit in
13-Apr-23  08:49 PM                87 example.txt
05-Apr-23  04:44 PM             5,508 Excel_Sample.xlsx
06-Apr-23  05:49 PM            36,386 Exersice - Pandas.ipynb
23-Apr-23  06:48 PM           259,620 Explaination - Pandas.ipynb
19-Jan-23  05:45 PM             4,551 iris_data.csv
19-Jan-23  05:29 PM             2,998 iris_names.csv
27-Apr-23  12:55 PM    <DIR>          Machine Learning
05-Apr-23  04:47 PM               560 multi_index_example.txt
06-Apr-23  02:00 PM        16,239,776 Salaries.csv
04-Apr-23  04:52 PM            18,269 utube link.ipynb
               9 File(s)     16,567,755 bytes
               5 Dir(s)  114,275,471,360 bytes free

In [155]:
df.to_csv('example.txt',index=False)

In [156]:
df

     A    B  C  D
0  NaN  one  x  1
1  NaN  one  y  3
2  NaN  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

# Excel

In [157]:
pd.read_excel('Excel_Sample.xlsx',sheet_name ='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [159]:
import os

In [160]:
os

In [164]:
import glob

notebook_files = glob.glob("**/*.ipynb", recursive=True)

In [165]:
notebook_files

['Exersice - Pandas.ipynb',
 'Explaination - Pandas.ipynb',
 'utube link.ipynb',
 'DV - Pandas Bulit in\\Pandas Built-in  - DV.ipynb']

# To find a file path for jupiter notebook file

In [168]:
ls

 Volume in drive C is Local Disk
 Volume Serial Number is 90A7-8E7A

 Directory of C:\Users\dines\data science\Pandas

09-Jun-23  02:58 PM    <DIR>          .
18-May-23  12:29 AM    <DIR>          ..
13-Apr-23  08:44 PM    <DIR>          .ipynb_checkpoints
13-Apr-23  11:32 AM    <DIR>          DV - Pandas Bulit in
09-Jun-23  02:35 PM                78 example.txt
05-Apr-23  04:44 PM             5,508 Excel_Sample.xlsx
06-Apr-23  05:49 PM            36,386 Exersice - Pandas.ipynb
09-Jun-23  02:58 PM           254,071 Explaination - Pandas.ipynb
19-Jan-23  05:45 PM             4,551 iris_data.csv
19-Jan-23  05:29 PM             2,998 iris_names.csv
27-Apr-23  12:55 PM    <DIR>          Machine Learning
05-Apr-23  04:47 PM               560 multi_index_example.txt
06-Apr-23  02:00 PM        16,239,776 Salaries.csv
04-Apr-23  04:52 PM            18,269 utube link.ipynb
               9 File(s)     16,562,197 bytes
               5 Dir(s)  114,263,994,368 bytes free

In [ ]:
df = read_csv("")